// 题目：企业发放的奖金根据利润提成。
// 利润(I)低于或等于10万元时，奖金可提10%；
// 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
// 20万到40万之间时，高于20万元的部分，可提成5%；
// 40万到60万之间时高于40万元的部分，可提成3%；
// 60万到100万之间时，高于60万元的部分，可提成1.5%；
// 高于100万元时，超过100万元的部分按1%提成。
// 从键盘输入当月利润I，求应发放奖金总数？

// 程序分析：定义时需把奖金定义成双精度浮点(double)型。
#include <stdio.h>
int main()
{
    double sum = 0;
    scanf("%lf", &sum);
    double s=sum/10000;
    double jin_e = 0;
    if(s>100)
    {
        jin_e = 40*0.015+20*0.03+20*0.05+10*0.075+10*0.1+(s-100)*0.01;
    }else if(s<=100)
    {
        jin_e = 20*0.03+20*0.05+10*0.075+10*0.1+(s-60)*0.05;
    }else if(s<=60)
    {
        jin_e = 20*0.05+10*0.075+10*0.1+(s-40)*0.05;
    }else if(s<=40)
    {
        jin_e = 10*0.075+10*0.1+(s-20)*0.05;
    }else if(s<=20)
    {
        jin_e = 10*0.1+(s-10)*0.075;
    }else if(s<=10)
    {
        jin_e = s*0.1;
    }
    printf("%lf", jin_e*10000);
    return 0;
}